MQTT/Reporte_100_Usuarios/statistics.json
{
  "Pub Message" : {
    "transaction" : "Pub Message",
    "sampleCount" : 2000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 198.46400000000028,
    "medianResTime" : 195.0,
    "minResTime" : 187.0,
    "maxResTime" : 227.0,
    "pct1ResTime" : 210.0,
    "pct2ResTime" : 211.0,
    "pct3ResTime" : 213.0,
    "throughput" : 53.59056806002144,
    "receivedKBytesPerSec" : 1.0466907824222937,
    "sentKBytesPerSec" : 3.611083199356913
  },
  "MQTT Disconnect" : {
    "transaction" : "MQTT Disconnect",
    "sampleCount" : 2000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 85.97150000000002,
    "medianResTime" : 86.0,
    "minResTime" : 81.0,
    "maxResTime" : 103.0,
    "pct1ResTime" : 88.0,
    "pct2ResTime" : 90.0,
    "pct3ResTime" : 94.0,
    "throughput" : 53.76633152320017,
    "receivedKBytesPerSec" : 0.5775680144093769,
    "sentKBytesPerSec" : 0.0
  },
  "Sub Validation" : {
    "transaction" : "Sub Validation",
    "sampleCount" : 2000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 53.8923769232842,
    "receivedKBytesPerSec" : 3.6314199294009866,
    "sentKBytesPerSec" : 0.0
  },
  "MQTT Connect (SSL)" : {
    "transaction" : "MQTT Connect (SSL)",
    "sampleCount" : 2000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 348.3279999999999,
    "medianResTime" : 348.0,
    "minResTime" : 334.0,
    "maxResTime" : 501.0,
    "pct1ResTime" : 356.0,
    "pct2ResTime" : 360.0,
    "pct3ResTime" : 370.99,
    "throughput" : 53.16745088656724,
    "receivedKBytesPerSec" : 0.5711347263205466,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 8000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 158.19087500000052,
    "medianResTime" : 145.0,
    "minResTime" : 0.0,
    "maxResTime" : 501.0,
    "pct1ResTime" : 350.0,
    "pct2ResTime" : 353.0,
    "pct3ResTime" : 362.0,
    "throughput" : 206.66494445879619,
    "receivedKBytesPerSec" : 5.600539266339447,
    "sentKBytesPerSec" : 3.4814163006974943
  }
}