MQTT/Reporte_50_Usuarios/statistics.json
{
  "Pub Message" : {
    "transaction" : "Pub Message",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 199.37400000000005,
    "medianResTime" : 195.0,
    "minResTime" : 189.0,
    "maxResTime" : 215.0,
    "pct1ResTime" : 211.0,
    "pct2ResTime" : 211.0,
    "pct3ResTime" : 213.0,
    "throughput" : 26.89545735725236,
    "receivedKBytesPerSec" : 0.5253019015088352,
    "sentKBytesPerSec" : 1.8122915602054814
  },
  "MQTT Disconnect" : {
    "transaction" : "MQTT Disconnect",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 85.82599999999991,
    "medianResTime" : 86.0,
    "minResTime" : 81.0,
    "maxResTime" : 98.0,
    "pct1ResTime" : 88.0,
    "pct2ResTime" : 89.0,
    "pct3ResTime" : 92.0,
    "throughput" : 26.989824836036814,
    "receivedKBytesPerSec" : 0.2899297589808642,
    "sentKBytesPerSec" : 0.0
  },
  "Sub Validation" : {
    "transaction" : "Sub Validation",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 27.051885516420494,
    "receivedKBytesPerSec" : 1.8228321295244279,
    "sentKBytesPerSec" : 0.0
  },
  "MQTT Connect (SSL)" : {
    "transaction" : "MQTT Connect (SSL)",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 347.8870000000005,
    "medianResTime" : 347.0,
    "minResTime" : 334.0,
    "maxResTime" : 652.0,
    "pct1ResTime" : 354.0,
    "pct2ResTime" : 357.0,
    "pct3ResTime" : 368.0,
    "throughput" : 26.68801708033093,
    "receivedKBytesPerSec" : 0.2866876834801174,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 4000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 158.2717500000001,
    "medianResTime" : 143.5,
    "minResTime" : 0.0,
    "maxResTime" : 652.0,
    "pct1ResTime" : 349.0,
    "pct2ResTime" : 352.0,
    "pct3ResTime" : 358.0,
    "throughput" : 103.7344398340249,
    "receivedKBytesPerSec" : 2.811162798236514,
    "sentKBytesPerSec" : 1.7474795772821576
  }
}